; domain
(define (domain kitchen-line)
  (:requirements :strips :typing)
  (:types chef recipe utensil garnish)
  (:predicates
  (carries ?i - utensil ?s - chef)
  (prepares ?i - utensil ?m - garnish)
  (focused_on ?s - chef ?d - recipe)
  (energy_spare ?s - chef)
  (energy_active ?i - utensil)
  (sharpened ?i - utensil)
  (have_dish ?d - recipe ?m - garnish)
  (sharpening_recipe ?i - utensil ?d - recipe))

  (:action switch_focus
   :parameters (?s - chef ?d_new - recipe ?d_prev - recipe)
   :precondition (and (focused_on ?s ?d_prev))
   :effect (and  (focused_on ?s ?d_new)
                 (not (focused_on ?s ?d_prev))))

  (:action fire_up
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_spare ?s))
   :effect (and (energy_active ?i)
                (not (sharpened ?i))
                (not (energy_spare ?s))))

  (:action cool_down
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_active ?i))
   :effect (and (not (energy_active ?i))
                (energy_spare ?s)))

  (:action sharpen
   :parameters (?s - chef ?i - utensil ?d - recipe)
   :precondition (and (carries ?i ?s)
          (sharpening_recipe ?i ?d)
                      (focused_on ?s ?d)
                      (energy_active ?i))
   :effect (sharpened ?i))

  (:action plate_dish
   :parameters (?s - chef ?d - recipe ?i - utensil ?m - garnish)
   :precondition (and (sharpened ?i)
                      (carries ?i ?s)
                      (prepares ?i ?m)
                      (energy_active ?i)
                      (focused_on ?s ?d))
   :effect (have_dish ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain kitchen-line)
(:objects
	chef0 - chef
	utensil0 - utensil
	chef1 - chef
	utensil1 - utensil
	griddle0 - garnish
	entree0 - recipe
	pantry1 - recipe
	appetiser2 - recipe
	entree3 - recipe
	entree4 - recipe
)
(:init
	(prepares utensil0 griddle0)
	(sharpening_recipe utensil0 entree0)
	(carries utensil0 chef0)
	(energy_spare chef0)
	(focused_on chef0 pantry1)
	(prepares utensil1 griddle0)
	(sharpening_recipe utensil1 pantry1)
	(carries utensil1 chef1)
	(energy_spare chef1)
	(focused_on chef1 appetiser2)
)
(:goal (and
	(have_dish appetiser2 griddle0)
	(have_dish entree3 griddle0)
	(have_dish entree4 griddle0)
))

)

; plan
1. (fire_up utensil1 chef1)
   deleted: (energy_spare chef1)
   added: (energy_active utensil1)
   goals met: 0 of 3
2. (switch_focus chef1 pantry1 appetiser2)
   deleted: (focused_on chef1 appetiser2)
   added: (focused_on chef1 pantry1)
   goals met: 0 of 3
3. (sharpen chef1 utensil1 pantry1)
   added: (sharpened utensil1)
   goals met: 0 of 3
4. (switch_focus chef1 appetiser2 pantry1)
   deleted: (focused_on chef1 pantry1)
   added: (focused_on chef1 appetiser2)
   goals met: 0 of 3
5. (plate_dish chef1 appetiser2 utensil1 griddle0)
   added: (have_dish appetiser2 griddle0)
   goals met: 1 of 3
6. (switch_focus chef1 entree3 appetiser2)
   deleted: (focused_on chef1 appetiser2)
   added: (focused_on chef1 entree3)
   goals met: 1 of 3
7. (plate_dish chef1 entree3 utensil1 griddle0)
   added: (have_dish entree3 griddle0)
   goals met: 2 of 3
8. (switch_focus chef1 entree4 entree3)
   deleted: (focused_on chef1 entree3)
   added: (focused_on chef1 entree4)
   goals met: 2 of 3
9. (plate_dish chef1 entree4 utensil1 griddle0)
   added: (have_dish entree4 griddle0)
   goals met: 3 of 3
